<pad>	0
<s>	1
</s>	2
<unk>	3
+	4
A	5
C	6
E	7
G	8
H	9
I	10
K	11
M	12
S	13
T	14
W	15
Z	16
a	17
ai̯	18
aː	19
aːi̯	20
b	21
bː	22
c	23
d	24
dz	25
dʒ	26
dː	27
e	28
ei̯	29
eː	30
f	31
fː	32
g	33
gː	34
h	35
i	36
iː	37
j	38
jː	39
k	40
kʼ	41
kʼː	42
kː	43
l	44
lː	45
m	46
mː	47
n	48
nː	49
o	50
oi̯	51
oː	52
p	53
pː	54
q	55
r	56
rː	57
s	58
sʼ	59
sː	60
t	61
tʃ	62
tʃʼ	63
tʃː	64
tʼ	65
tʼː	66
tː	67
u	68
uː	69
w	70
wː	71
x	72
xː	73
y	74
z	75
zː	76
ħ	77
ɘ	78
ə	79
əi̯	80
ɨ	81
ɨi̯	82
ɨː	83
ɲ	84
ɲː	85
ʃ	86
ʃː	87
ʒ	88
ʔ	89
ʕ	90
β	91
